
import time

def start_game():
    print("Ласкаво просимо в гру!")
    time.sleep(1)
    print("Ви попали у велике місто.Ваш вибір:")
    time.sleep(1)
    print("1. Піти з друзями випити кави.\n2.Прогулятись парком.\n")
    
    choice = input("Введіть 1 чи 2: ")
    
    if choice == "1":
        coffe_time()
    elif choice == "2":
        park_time()
    else:
        print("Ваш вибір неможливй.Введіть 1 або 2.")
        start_game()

def coffe_time():
    print("\nВи прийшли в кафе.")
    print("Яку каву оберете?\n1.Капучіно\n2.Лате\n")
    
    choice = input("Введіть 1 чи 2: ")
    
    if choice == "1":
        print("\nВи насолоджуєтесь своїм капучіно.\nРаптом до вас приходить незнайомець,просить у вас гроші.")
        print("1.Ви позичаєте пару гривень.\n2.Ви не звертаєте на нього увагу.\n")
        choice = input("Ваш вибір: ")
        if choice == "1":
           print("\nУ вас добра душа.Ви виграли!")
        elif choice == "2":
            print("\nВи не добра людина.Ви програли!")
            
    elif choice == "2":
        print("\nВи насолоджуєтесь своїм лате.\nВи допили свою каву та до вас підходить офіціант.\nВи оплачуєте замовлення.\nОплачуючи,ви замічаєте на столі офіцінтки коробку з чайовими.\nЧи дастети ви чайові?\n1.Так\n2.Ні\n")
        choice = input("Введіть 1 чи 2: ")
        if choice == "1":
            print("\nУ вас добра душа.Ви виграли!")
        elif choice == "2":
            print("\nВи не добра людина.Ви програли!")
    
    else:
        print("Ваш вибір неможливй.Введіть 1 або 2.")
        coffe_time()

def park_time():
    print("\nВи відправились на прогулянку парком.\nЯкий шлях ви оберете?\n1.Право.\n2.Ліво")
    
    choice = input("Введіть 1 чи 2: ")
    
    if choice == "1":
        print("\nВи помічаєте незрячу бабусю,яка наближається до пішохідного переходу\nЧи врятуєте ви бабусю?\n1.Так\n2.Ні")
        choice = input("Введіть 1 чи 2: ")
        if choice == "1":
            print("\nУ вас добра душа.Ви виграли!")
        elif choice == "2":
          print("\nВи не добра людина.Ви програли!")
            
        
    elif choice == "2":
        print("\nВи проходите повз вуличного музиканта,граючого на гітарі.\nВам сподобалась його гра.\nВи помічаєте табличку з надписом 'Збираю гроші'.\nВаш вибір:\n1.Дати гроші\n2.Йти далі\n")
        choice = input("Введіть 1 чи 2: ")
        if choice == "1":
            print("\nУ вас добра душа.Ви виграли!")
        elif choice == "2":
            print("\nВи не добра людина.Ви програли!")
    
        else:
          print("Ваш вибір неможливй.Введіть 1 або 2.")
          park_time()
          
if __name__ == "__main__":
     start_game()